#def f(a):
    #global b
    #b=b+1
    #print(b)
#a='2'
#b=3
#f(a)
#print(b)
#'Синус через универсальную тригонометрическую подстановку',
#'Тангенс через универсальную тригонометрическую подстановку',
def f():
a=['Выберите вариант ответа.\nОсновное тригонометрическое тождество, которое связывает синус и косинус..\n1. sin0+2cos60=30\n2. sinA^2+cosA^2=1 \n3. 2sin^2A-1',
   'Напишите пропущенное слово с соответствии с падежом.\nКосинусом угла называется ... соответсвующей ему точки на единичной окружности'
   'Выберите вариант ответа.\nСинус двойного угла..\n1. sin 2A = 1-2sinA^2 \n2. sin 2A = cosA^2-2cosA \n3. 2*cosA*',
   'Выберите вариант ответа.\nКотангенс двойного угла..',
   'Выберите вариант ответа.\nРазность синусов разных углов..']
b=['sin^2A+cos^2A=1',
   'абцисса',
   'sin 2A= 2*sinA*cosA',
   'ctg 2A = ctgA^2-1 / 2ctgA',
   'sin A -  sin B = 2*sin((A-B)/2)*cos((A+B)) 
   

    print('это жесткий тест по тригонометрии от Натальи Павловны'





a=[''
   '3']
if
print(f)
    a=b=0
    a,b=b,a
input
for i in range(len(a)):
    a[i]
for i in range a:






f()
de
